cask_args appdir: '/Applications'

tap 'caskroom/cask'
tap 'homebrew/bundle'
tap 'homebrew/services'

brew 'autoconf'
brew 'automake'
brew 'cmake'
brew 'coreutils'
brew 'curl'
brew 'docker'
brew 'docker-buildx'
brew 'docker-compose'
brew 'docker-credential-helper'
brew 'dockutil'
brew 'findutils'
brew 'git'
brew 'git-gui'
brew 'git-lfs'
brew 'glib'
brew 'hurl'
brew 'jq'
brew 'libtool'
brew 'markdownlint-cli'
brew 'pyenv'
brew 'rbenv'
brew 'rustup'
brew 'sdkman-cli'
brew 'tldr'
brew 'wget'
brew 'yq'
brew 'zsh'

cask 'firefox@developer-edition'
cask 'font-meslo-lg-nerd-font'
cask 'iterm2'
cask 'rectangle'
cask 'spotify'
cask 'visual-studio-code'

vscode 'bierner.markdown-mermaid'
vscode 'bradymholt.pgformatter'
vscode 'davidanson.vscode-markdownlint'
vscode 'github.copilot'
vscode 'github.copilot-chat'
vscode 'jacobpfeifer.pfeifer-hurl'
vscode 'jebbs.plantuml'
vscode 'ldez.ignore-files'
vscode 'mermade.openapi-lint'
vscode 'mervin.markdown-formatter'
vscode 'ms-azuretools.vscode-containers'
vscode 'ms-vscode-remote.remote-containers'
vscode 'redhat.vscode-yaml'
vscode 'weilence.conf-formatter'
