cask_args appdir: '/Applications'

tap 'homebrew/bundle'
tap 'homebrew/cask-versions'
tap 'sdkman/tap'
tap 'homebrew/cask-fonts'

brew 'git'
brew 'openssl'
brew 'zsh'
brew 'eza'
brew 'sdkman-cli'
brew 'findutils'
brew 'pyenv'
brew 'rbenv'
brew 'rbenv'

cask 'firefox-developer-edition' 
cask 'iterm2'
cask 'visual-studio-code'
cask 'docker'
cask 'spotify'
cask 'rectangle'
cask 'font-meslo-lg-nerd-font'